// Задайте строку, содержащую латинские буквы в обоих регистрах.
// Сформируйте строку, в которой все заглавные буквы заменены на строчные.

string str = "aBcDe1FG6";
str = str.ToLower();

Console.WriteLine(str);

